{
    "examId": "EXAM001",
    "title": "Principles of Programming Languages Midterm",
    "chapters": [
        {
            "chapterTitle": "1.Introduction",
            "questions": [
                {
                    "questionId": "I1",
                    "questionText": "เกณฑ์ที่ใช้ในการพิจารณาภาษาโปรแกรม (Language Evaluation Criteria) มีกี่เกณฑ์ และแต่ละเกณฑ์คืออะไร",
                    "modelAnswers": [
                        "3 เกณฑ์",
                        "Readability ความอ่านเข้าใจง่าย หมายถึง ความสามารถในการทำให้โค้ดสามารถอ่านและเข้าใจได้ง่าย ไม่ว่าจะโดยผู้เขียนหรือผู้อื่นที่อ่านภายหลัง",
                        "Writability ความง่ายในการเขียนโปรแกรม หมายถึง ความสะดวกและยืดหยุ่นในการแสดงความคิดหรือแนวทางการแก้ปัญหาผ่านโค้ดของภาษาโปรแกรม",
                        "Reliability ความเชื่อถือได้ของโปรแกรม หมายถึง ความสามารถของภาษาในการช่วยลดข้อผิดพลาด และทำให้โปรแกรมทำงานถูกต้อง"
                    ]
                },
                {
                    "questionId": "I2",
                    "questionText": "ไม่มีชนิดข้อมูล Boolean ให้ใช้งาน เกี่ยวข้องกับเกณฑ์ใด เป็นข้อดีหรือข้อเสีย เพราะเหตุใด",
                    "modelAnswers": [
                        "เกณฑ์: readability/writability",
                        "เป็นข้อเสีย",
                        "เพราะทำให้อ่าน/เขียนโปรแกรมแล้วเข้าใจยาก เช่น ในภาษา C เมื่อต้องการกำหนดค่าให้เป็น true/false ต้องใช้ชนิดข้อมูลเป็น int ที่มีค่า 1 หรือ 0 แทน"
                    ]
                },
                {
                    "questionId": "I3",
                    "questionText": "มีข้อจำกัดและข้อยกเว้นมาก เช่น พารามิเตอร์ทุกชนิดส่งผ่านด้วยวิธี pass by value ยกเว้นอาร์เรย์ที่ต้องผ่านโดยวิธี pass by reference เกี่ยวข้องกับเกณฑ์ใด เป็นข้อดีหรือข้อเสีย เพราะเหตุใด",
                    "modelAnswers": [
                        "เกณฑ์: readability/writability",
                        "เป็นข้อเสีย",
                        "เพราะการอ่าน/เขียนโปรแกรมต้องจดจำข้อจำกัดหรือข้อยกเว้นที่มีมาก ทำให้ภาษาค่อนข้างยากต่อการเรียนรู้"
                    ]
                },
                {
                    "questionId": "I4",
                    "questionText": "มี precedence rules ที่แบ่งลำดับความสำคัญของ operator มากถึง 15 ลำดับ เกี่ยวข้องกับเกณฑ์ใด เป็นข้อดีหรือข้อเสีย เพราะเหตุใด",
                    "modelAnswers": [
                        "เกณฑ์: readability/writability",
                        "เป็นข้อเสีย",
                        "เพราะการอ่าน/เขียนโปรแกรมต้องจดจำลำดับความสำคัญที่มีมาก ทำให้ภาษาค่อนข้างยากต่อการเรียนรู้"
                    ]
                },
                {
                    "questionId": "I5",
                    "questionText": "มีรูปแบบคำสั่ง for ที่ใช้ในการวนลูปที่รู้จำนวนครั้งที่แน่นอน เกี่ยวข้องกับเกณฑ์ใด เป็นข้อดีหรือข้อเสีย เพราะเหตุใด",
                    "modelAnswers": [
                        "เกณฑ์: readability",
                        "เป็นข้อดี",
                        "เพราะการอ่านโปรแกรมเข้าใจได้ง่าย เพราะช่วยให้รู้จำนวนครั้งหรือเงื่อนไขในการวนลูปที่ชัดเจน"
                    ]
                },
                {
                    "questionId": "I6",
                    "questionText": "สามารถใช้ pointer ในการชี้ไปยังตำแหน่งในหน่วยความจำที่เก็บค่าของตัวแปรได้ เกี่ยวข้องกับเกณฑ์ใด เป็นข้อดีหรือข้อเสีย เพราะเหตุใด",
                    "modelAnswers": [
                        "เกณฑ์: writability/reliability",
                        "เป็นข้อเสีย",
                        "เพราะการเขียนโปรแกรมมีโอกาสผิดพลาดได้ง่าย เพราะมีมากกว่าชื่อที่สามารถเข้าถึงหน่วยความจำในตำแหน่งเดียวกันได้"
                    ]
                },
                {
                    "questionId": "I7",
                    "questionText": "ภาษาสคริปต์ (Scripting language) มีลักษณะอย่างไร พร้อมยกตัวอย่างมา 2 ภาษา",
                    "modelAnswers": [
                        "เป็นภาษาที่ออกแบบมาสำหรับควบคุมโปรแกรมอื่นหรือเขียนโปรแกรมขนาดเล็ก ทำงานแบบ interpreter",
                        "ตัวอย่าง: Python, JavaScript"
                    ]
                },
                {
                    "questionId": "I8",
                    "questionText": "ภาษา Markup เช่น HTML, XML, XHTML มีลักษณะอย่างไร เพราะเหตุใดจึงไม่จัดว่าเป็นภาษาโปรแกรม",
                    "modelAnswers": [
                        "เป็นภาษาที่ใช้กำหนดโครงสร้างข้อมูลหรือเอกสาร",
                        "เพราะไม่ถือเป็นภาษาโปรแกรมเพราะไม่มีลักษณะการควบคุมการทำงานหรือคำนวณ"
                    ]
                }
            ]
        },
        {
            "chapterTitle": "2.Programming language syntax",
            "questions": [
                {
                    "questionId": "S1",
                    "questionText": "อธิบายความหมายของคำว่า Syntax และ Semantic",
                    "modelAnswers": [
                        "Syntax คือ ไวยากรณ์หรือโครงสร้างและรูปแบบของภาษา ซึ่งระบุว่าจะเขียนคำสั่งอย่างไร ",
                        "Semantic คือ ความหมายของคำสั่งที่เขียนไป ซึ่งจะบอกว่าคำสั่งนั้นทำงานอะไร มีลำดับการทำงานอย่างไร"
                    ]
                },
                {
                    "questionId": "S2",
                    "questionText": "จงระบุ lexemes ทั้งหมดของคำสั่งในภาษา C ต่อไปนี้ index = 2 * count + 17 ; ",
                    "modelAnswers": [
                        "lexemes 8 ตัว ได้แก่ index, =, 2, *, count, +, 17 และ ;"
                    ]
                }
            ]
        },
        {
            "chapterTitle": "3.Names, scopes, and bindings",
            "questions": [
                {
                    "questionId": "N1",
                    "questionText": "รูปแบบชื่อใดอ่านง่ายที่สุด: SumOfSales, Sum_of_sales, SUMOFSALES",
                    "modelAnswers": [
                        "Sum_of_sales หรือ SumOfSales แต่ต้องให้เหตุผลที่เลือกอย่างเหมาะสม",
                        "เช่น Sum_of_sales เพราะทำให้อ่านแยกคำได้ง่าย เนื่องจากใช้เครื่องหมาย _ แทนการใช้ space หรือ SumOfSales เพราะทำให้อ่านแยกคำได้ง่าย เนื่องจากใช้ตัวอักษรใหญ่เมื่อขึ้นต้นคำ"
                    ]
                },
                {
                    "questionId": "N2",
                    "questionText": "จงเปรียบเทียบ static variable, stack-dynamic variable และ heap dynamic variable ใน C/C++ ในแง่ประสิทธิภาพด้านเวลา เมื่อมีการสร้างและเรียกใช",
                    "modelAnswers": [
                        "static variable ใช้เวลาน้อยที่สุดเพราะไม่ต้อง allocate/deallocate",
                        "ส่วน stack-dynamic และ heap-dynamic ใช้เวลาใกล้เคียงกัน",
                        "เนื่องจาก static variable ไม่เสียเวลาในการ allocation และ deallocation"
                    ]
                },
                {
                    "questionId": "N3",
                    "questionText": "type binding ของภาษา C เป็น static หรือ dynamic ให้เหตุผลประกอบ",
                    "modelAnswers": [
                        "เป็นแบบ static type binding เนื่องจากทำการเชื่อมโยงชนิดข้อมูลกับตัวแปรตั้งแต่ compile time ทำให้ตัวแปรไม่สามารถเปลี่ยนแปลงชนิดข้อมูลได้หลังการเชื่อมโยงเสร็จสิ้นแล้ว"
                    ]
                },
                {
                    "questionId": "N4",
                    "questionText": "หลักการตั้งชื่อในภาษาจาวา กําหนดความยาวสูงสุดของชื่อไว้หรือไม่ ถ้ากําหนดไว้ ระบุความยาว สูงสุดเท่าใด",
                    "modelAnswers": [
                        "ไม่มีการกำหนดความยาวสูงสุดอย่างชัดเจน"
                    ]
                },
                {
                    "questionId": "N5",
                    "questionText": "ยกตัวอย่างการตั้งชื่อตัวแปรสำหรับ sum of scores ตาม naming convention อย่างน้อย 3 ชื่อ",
                    "modelAnswers": [
                        "sumOfScores",
                        "sum_scores",
                        "SumScores"
                    ]
                }
            ]
        },
        {
            "chapterTitle": "4.Data types",
            "questions": [
                {
                    "questionId": "D1",
                    "questionText": "การใช้ pointer อาจก่อให้เกิดปัญหาอะไรได้บ้าง",
                    "modelAnswers": [
                        "การเรียกใช้งานพอยเตอร์ที่ชี้ไปยังพื้นที่ที่ยกเลิกการจัดสรรพื้นที่แล้ว (dangling pointer) ทำให้ เกิดข้อผิดพลาดเมื่อมีการอ้างถึงค่าในตำแหน่งที่พอยเตอร์เก็บอยู่",
                        "การเกิดขยะ (garbage หรือ lost heap-dynamic variable) เนื่องจากไม่มีพอยเตอร์ใดเข้าถึง พื้นที่ที่ถูกจัดสรรพื้นที่แล้ว ไม่สามารถคืนพื้นที่ส่วนนี้ได้ เมื่อมีเกิดขยะจำนวนมาก และโปรแกรม ทำงานไปนานๆ อาจจะทำให้เกิดปัญหาหน่วยความจำไม่เพียงพอต่อการทำงานได้"
                    ]
                },
                {
                    "questionId": "D2",
                    "questionText": "Type checking คืออะไร มีกี่ประเภทแต่ละประเภทมีความหมายว่าอย่างไร",
                    "modelAnswers": [
                        "Type checking คือ การตรวจสอบชนิดข้อมูลก่อนที่จะมีการดำเนินการใดๆ เพื่อป้องกันไม่ให้เกิดการดำเนินการที่เป็นไปไม่ได้กับชนิดข้อมูลหนึ่งๆ เช่น นำข้อมูลชนิดอักขระมาทำการคูณกับข้อมูลชนิด ตรรกะ",
                        "แบ่งเป็น 2 ประเภทตามช่วงเวลาที่ตรวจสอบ คือ Static type checking ตรวจสอบชนิดข้อมูลเกิดขึ้นในช่วงเวลาคอมไพล์ Dynamic type checking ตรวจสอบชนิดข้อมูลเกิดขึ้นในช่วงเวลารันโปรแกรม"
                    ]
                },
                {
                    "questionId": "D3",
                    "questionText": "ภาษา Java เป็น strong typed หรือไม่ เพราะเหตุใด",
                    "modelAnswers": [
                        "เป็น strong typed เพราะไม่สามารถใช้ตัวแปรกับชนิดที่ไม่ตรงกันโดยไม่ประกาศ"
                    ]
                },
                {
                    "questionId": "D4",
                    "questionText": "สร้าง user-defined type ชื่อ Boolean ในภาษา C",
                    "modelAnswers": [
                        "typedef enum { false, true } Boolean;"
                    ]
                }
            ]
        },
        {
            "chapterTitle": "5.Expression and assignment",
            "questions": [
                {
                    "questionId": "E1",
                    "questionText": "อธิบายความหมายของ operator overloading ",
                    "modelAnswers": [
                        "การกำหนดให้ Operator สามารถทำงานต่างกันได้เมื่อใช้งานกับชนิดข้อมูลที่แตกต่างกัน",
                        "เช่น operator / ในภาษา C เมื่อใช้กับชนิดข้อมูล int จะเป็นการหารไม่เอาเศษ แต่ถ้าใช้กับ float จะได้ผลหารเป็น เลขทศนิยม"
                    ]
                }
            ]
        },
        {
            "chapterTitle": "6.Control flow",
            "questions": [
                {
                    "questionId": "C1",
                    "questionText": "ยกตัวอย่างการเขียน infinite loop ด้วย for และ while",
                    "modelAnswers": [
                        "for(;;) {...}",
                        "while(1) {...}"
                    ]
                }
            ]
        }
    ]
}